app/controllers/bars_controller.rb

SELECT "bars".* FROM "bars"
---
    def index
        @bars = Bar.all