app/controllers/registrations_controller.rb

    def create
        user = User.create!(
            username: params['user']['username'],
            password: params['user']['password'],
            password_confirmation: params['user']['password'],
        )
---
INSERT INTO "users" ("username", "password_digest", "image", "about", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"