app/controllers/sessions_controller.rb

    def create
        user = User
        .find_by(username: params["user"]["username"])
        .try(:authenticate, params["user"]["password"])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]