app/controllers/user_bars_controller.rb

SELECT "user_bars".* FROM "user_bars"
---
    def index
        @userBars = UserBar.all