app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "image", "about", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", ""], ["password", ""], ["image", ""], ["about", ""], ["created_at", "2020-04-23 20:09:21.714402"], ["updated_at", "2020-04-23 20:09:21.714402"]]
---
  def create
    user = User.create(user_params)